Terraform Format and Style: success
Terraform Initialization: success
Terraform Validation: success
Terraform Plan: success

<details><summary>Show Plan</summary>

```

module.csv_upload_bucket.data.cloudfoundry_service.s3: Reading...
module.database.data.cloudfoundry_space.space: Reading...
module.redis.data.cloudfoundry_space.space: Reading...
module.csv_upload_bucket.data.cloudfoundry_space.space: Reading...
module.sns_sms.data.cloudfoundry_space.space: Reading...
module.ses_email.data.cloudfoundry_service.ses: Reading...
module.egress-space.data.cloudfoundry_org.org: Reading...
module.redis.data.cloudfoundry_service.redis: Reading...
module.ses_email.data.cloudfoundry_space.space: Reading...
module.sns_sms.data.cloudfoundry_service.sns: Reading...
module.csv_upload_bucket.data.cloudfoundry_service.s3: Read complete after 1s [id=440ce9d9-b108-4bbe-80b4-08338f3cc25b]
module.database.data.cloudfoundry_service.rds: Reading...
module.ses_email.data.cloudfoundry_service.ses: Read complete after 1s [id=8bf5287d-587b-4696-8e53-a6ffdba211c0]
module.sns_sms.data.cloudfoundry_service.sns: Read complete after 1s [id=37cbe836-d604-45d1-b1f8-1403f7cb3ff7]
module.redis.data.cloudfoundry_service.redis: Read complete after 1s [id=045871d3-d9a8-4a9b-a844-00a067fab054]
module.egress-space.data.cloudfoundry_org.org: Read complete after 1s [id=9e428562-a2d9-41b4-9c23-1ef5237fb44e]
module.egress-space.data.cloudfoundry_user.users["dd4002f6-951d-44b2-b88c-1b828e98dc01"]: Reading...
module.database.data.cloudfoundry_service.rds: Read complete after 0s [id=dcfb1d43-f22c-42d3-962c-7ae04eda24e7]
module.csv_upload_bucket.data.cloudfoundry_space.space: Read complete after 1s [id=4447d89a-9735-4d82-94e1-dc07713aa460]
module.sns_sms.data.cloudfoundry_space.space: Read complete after 1s [id=4447d89a-9735-4d82-94e1-dc07713aa460]
module.redis.data.cloudfoundry_space.space: Read complete after 1s [id=4447d89a-9735-4d82-94e1-dc07713aa460]
module.database.data.cloudfoundry_space.space: Read complete after 1s [id=4447d89a-9735-4d82-94e1-dc07713aa460]
module.ses_email.data.cloudfoundry_space.space: Read complete after 1s [id=4447d89a-9735-4d82-94e1-dc07713aa460]
module.egress-space.data.cloudfoundry_user.users["dd4002f6-951d-44b2-b88c-1b828e98dc01"]: Read complete after 0s [id=c51e169a-d8d0-4179-adff-ef871ba9e8ae]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.csv_upload_bucket.cloudfoundry_service_instance.bucket will be created
  + resource "cloudfoundry_service_instance" "bucket" {
      + id                             = (known after apply)
      + name                           = "notify-api-csv-upload-bucket-production"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "021bb2a3-7e11-4fc2-b06b-d9f5938cd806"
      + space                          = "4447d89a-9735-4d82-94e1-dc07713aa460"
    }

  # module.database.cloudfoundry_service_instance.rds will be created
  + resource "cloudfoundry_service_instance" "rds" {
      + id                             = (known after apply)
      + name                           = "notify-api-rds-production"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "731eb930-81ea-4a03-82f2-a187d8339d14"
      + space                          = "4447d89a-9735-4d82-94e1-dc07713aa460"
    }

  # module.egress-space.cloudfoundry_space.public_egress will be created
  + resource "cloudfoundry_space" "public_egress" {
      + allow_ssh  = (known after apply)
      + auditors   = (known after apply)
      + developers = (known after apply)
      + id         = (known after apply)
      + managers   = (known after apply)
      + name       = "notify-production-egress"
      + org        = "9e428562-a2d9-41b4-9c23-1ef5237fb44e"
    }

  # module.egress-space.cloudfoundry_space_users.deployers will be created
  + resource "cloudfoundry_space_users" "deployers" {
      + auditors   = (known after apply)
      + developers = [
          + "c51e169a-d8d0-4179-adff-ef871ba9e8ae",
        ]
      + force      = false
      + id         = (known after apply)
      + managers   = [
          + "c51e169a-d8d0-4179-adff-ef871ba9e8ae",
        ]
      + space      = (known after apply)
    }

  # module.redis.cloudfoundry_service_instance.redis will be created
  + resource "cloudfoundry_service_instance" "redis" {
      + id                             = (known after apply)
      + name                           = "notify-api-redis-production"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "a5800f92-4fef-42f9-beb8-afac20fae841"
      + space                          = "4447d89a-9735-4d82-94e1-dc07713aa460"
    }

  # module.ses_email.cloudfoundry_service_instance.ses will be created
  + resource "cloudfoundry_service_instance" "ses" {
      + id                             = (known after apply)
      + json_params                    = jsonencode(
            {
              + domain                        = "notify.gov"
              + email_receipt_error           = "notify-support@gsa.gov"
              + enable_feedback_notifications = true
              + mail_from_subdomain           = "mail"
              + region                        = "us-gov-west-1"
            }
        )
      + name                           = "notify-api-ses-production"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "54c2c149-dd04-4941-a621-159f5e698e3c"
      + space                          = "4447d89a-9735-4d82-94e1-dc07713aa460"
    }

  # module.sns_sms.cloudfoundry_service_instance.sns will be created
  + resource "cloudfoundry_service_instance" "sns" {
      + id                             = (known after apply)
      + json_params                    = jsonencode(
            {
              + monthly_spend_limit = 1000
              + region              = "us-gov-west-1"
            }
        )
      + name                           = "notify-api-sns-production"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "71f89da8-38ed-4b9d-96c9-ff462762d755"
      + space                          = "4447d89a-9735-4d82-94e1-dc07713aa460"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @rahearn, Action: `pull_request`*